_Rarzrabotki/Rarus/USO2/Documents/УПН_РасторжениеСделкиПоНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_РасторжениеСделкиПоНедвижимости</Name>
			<BasedOn>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости</xr:Item>
				<xr:Item>InformationRegister.УСОERP_СоответствиеДоговоровИДолей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_СтатусыДокументовПоСделке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоНедвижимости</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УПН_ДоговорПоНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРасторжения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозврата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Санкции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УПН_РасчетыСКлиентамиПоОбъектамНедвижимости</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/АналитикаУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаПоПартнерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СоответствиеДоговоровИДолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СоответствиеДоговоровИДолей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расторгнут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_СтатусыДокументовПоСделке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Доля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УПН_СтатусыДокументовПоСделке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УПН_СтатусыДокументовПоСделке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_РасторжениеСделкиПоНедвижимости/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Инициализирует новый документ.
//
Процедура ИнициализироватьДокумент()

	Ответственный   = ПараметрыСеанса.ТекущийПользователь;
	Организация     = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	ДатаРасторжения = ТекущаяДата();
	СтатусДокумента = Перечисления.УПН_СтатусыДокументовПоСделке.НаСогласовании;
	
КонецПроцедуры // ИнициализироватьДокумент()

/////////////////////////////////////////////////////////////
// Процедуры проведения

// Процедура устанавливает статус сделки недвижимости
// как "Отменена".
//
// Параметры:
//  Нет.
//
Процедура Расторгнуть()
	
	// Спишем остатки задолженности
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыСКлиентамиПоОбъектамНедвижимости.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоОбъектамНедвижимости.Договор,
	|	РасчетыСКлиентамиПоОбъектамНедвижимости.ОбъектНедвижимости,
	|	РасчетыСКлиентамиПоОбъектамНедвижимости.Валюта,
	|	РасчетыСКлиентамиПоОбъектамНедвижимости.СуммаОстаток КАК Сумма,
	|	РасчетыСКлиентамиПоОбъектамНедвижимости.ПлощадьОстаток КАК Площадь
	|ИЗ
	|	РегистрНакопления.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Остатки(
	|			&Период,
	|			Договор = &Договор
	|				И ОбъектНедвижимости В (&ОбъектНедвижимости)) КАК РасчетыСКлиентамиПоОбъектамНедвижимости";
	
	Запрос.УстановитьПараметр("Договор", 			Договор);
	Запрос.УстановитьПараметр("ОбъектНедвижимости",	ОбъектыНедвижимости.ВыгрузитьКолонку("ОбъектНедвижимости"));
	Запрос.УстановитьПараметр("Период", 			МоментВремени());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Площадь Тогда
			Продолжить;
		КонецЕсли;
		
		//НоваяЗапись = Движения.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Добавить();
		//НоваяЗапись.Период = Дата;
		//
		//ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		//
		//НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
		//НоваяЗапись.Площадь     = Выборка.Площадь;
		//НоваяЗапись.Сумма       = 0;
		
		//Если Выборка.Сумма > 0 Тогда
		//	
		//	НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		//	//НоваяЗапись.Сумма = - Выборка.Сумма;			
		//	НоваяЗапись.Площадь = - Выборка.Площадь;
		//	
		//Иначе
		//	
		//	НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
		//	//НоваяЗапись.Сумма = Выборка.Сумма;  		
		//	НоваяЗапись.Площадь = Выборка.Площадь;
		//	
		//КонецЕсли;		
		
	КонецЦикла; 
	
	// Сделаем расход по возврату клиенту и приход на сумму санкций
	АналитикаУчетаПоПартнерам = РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(ЭтотОбъект);
	
	Для Каждого СтрокаТЧ Из ОбъектыНедвижимости Цикл
		
		Если СтрокаТЧ.СуммаВозврата <> 0 Тогда
			
			НоваяЗапись = Движения.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ОбъектНедвижимости = СтрокаТЧ.ОбъектНедвижимости;
			НоваяЗапись.АналитикаУчетаПоПартнерам = АналитикаУчетаПоПартнерам;
			НоваяЗапись.Договор = Договор;
			НоваяЗапись.Валюта = Договор.ВалютаВзаиморасчетов;
			НоваяЗапись.Сумма = СтрокаТЧ.СуммаВозврата;
			НоваяЗапись.Площадь = РегистрыНакопления.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Остатки(МоментВремени(),Новый Структура("Договор,ОбъектНедвижимости",Договор,СтрокаТЧ.ОбъектНедвижимости),,"Площадь").Итог("Площадь");
			
		КонецЕсли;
		
		Если СтрокаТЧ.Санкции Тогда
			
			НоваяЗапись = Движения.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ОбъектНедвижимости = СтрокаТЧ.ОбъектНедвижимости;
			НоваяЗапись.АналитикаУчетаПоПартнерам = АналитикаУчетаПоПартнерам;
			НоваяЗапись.Договор = Договор;
			НоваяЗапись.Валюта = Договор.ВалютаВзаиморасчетов;
			НоваяЗапись.Сумма = СтрокаТЧ.Санкции;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоответствиеДоговоровИДолей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасторжениеСделкиПоНедвижимости.Ссылка КАК Регистратор,
		|	РасторжениеСделкиПоНедвижимости.Ссылка.Дата КАК Период,
		|	РасторжениеСделкиПоНедвижимости.ОбъектНедвижимости КАК Доля,
		|	ИСТИНА КАК Расторгнут,
		|	РасторжениеСделкиПоНедвижимости.Ссылка.Договор КАК Договор,
		|	РасторжениеСделкиПоНедвижимости.Ссылка.Контрагент КАК Контрагент,
		|	РасторжениеСделкиПоНедвижимости.Ссылка.СтатусДокумента КАК Статус
		|ИЗ
		|	Документ.УПН_РасторжениеСделкиПоНедвижимости.ОбъектыНедвижимости КАК РасторжениеСделкиПоНедвижимости
		|ГДЕ
		|	РасторжениеСделкиПоНедвижимости.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = Движения.УСОERP_СоответствиеДоговоровИДолей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);

	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОНТРОЛЬ ПРОВЕДЕНИЯ

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры // СформироватьСписокРегистровДляКонтроля()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УПН_ДоговорПоНедвижимости") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Дата,Номер");
		ДоговорПоНедвижимости = ДанныеЗаполнения;
	КонецЕсли;
	
	ИнициализироватьДокумент();
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	//<{УСО 2.0}:{Управление строительным предприятием}{Последов Д.В.}
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Если  НЕ ДанныеЗаполнения.УСОERP_ДоговорДолевогоСтроительства Тогда
			Возврат;
		КонецЕсли;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Партнер = ДанныеЗаполнения.Контрагент.Партнер;
		Организация = ДанныеЗаполнения.Организация;
		Договор = ДанныеЗаполнения;
	КонецЕсли;
	//>{УСО 2.0}:{Управление строительным предприятием}{Последов Д.В.}
КонецПроцедуры  

Процедура ПриКопировании(ОбъектКопирования)
	
	СтатусДокумента = Перечисления.УПН_СтатусыДокументовПоСделке.НаСогласовании;
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.УСОERP_СоответствиеДоговоровИДолей.Записывать 			= Истина;
	Движения.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Записывать = Истина;
	
	Если СтатусДокумента <> Перечисления.УПН_СтатусыДокументовПоСделке.Подписано Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Расторгнуть();
	
	СоответствиеДоговоровИДолей();

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#КонецЕсли
